RoR Server/app/views/check_ins/daily_report.json.jbuilder

SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 22]]
---
    json.id check_in.user.id
  	json.first_name check_in.user.first_name