app/views/users/_form.html.erb

    <%= f.label :schedule_id %><br>
    <%= f.collection_select :schedule_id, Schedule.order(:check_in),:id,:check_in, include_blank: false %>
---
SELECT "schedules".* FROM "schedules"   ORDER BY "schedules"."check_in" ASC