RoR Server/app/controllers/check_ins_controller.rb

  def daily_report
    str = (params[:date])
    date = Date.parse str
    @check_ins = CheckIn.where(created_at: (date.midnight)..date.midnight + 1.day)
---
SELECT "check_ins".* FROM "check_ins"  WHERE ("check_ins"."created_at" BETWEEN '2014-08-21 00:00:00.000000' AND '2014-08-22 00:00:00.000000')

  def checkin
    if did_previous_checkin == true
      user = current_user
      @check_in = CheckIn.new(:checked_in_at => Time.now, :user_id => user.id)
      userTolerance = user.schedule.check_in + 30.minutes

      if userTolerance.strftime("%H%M") < @check_in.checked_in_at.strftime("%H%M")
        if user.points == nil
          user.points = 0
        end
        user.points = user.points + 1
        user.save!
---
INSERT INTO "check_ins" ("checked_in_at", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["checked_in_at", "2014-08-18 17:32:00.618557"], ["created_at", "2014-08-18 17:32:00.624416"], ["updated_at", "2014-08-18 17:32:00.624416"], ["user_id", 17]]