RoR Server/app/controllers/schedules_controller.rb

SELECT "schedules".* FROM "schedules"
---
  def index
    @schedules = Schedule.all

SELECT "schedules".* FROM "schedules"
---
  def all_schedules
    @schedules = Schedule.all

INSERT INTO "schedules" ("check_in", "check_out", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["check_in", "2000-01-01 11:30:00.000000"], ["check_out", "2000-01-01 12:30:00.000000"], ["created_at", "2014-08-21 17:55:18.949811"], ["updated_at", "2014-08-21 17:55:18.949811"]]
---
  def create
    @schedule = Schedule.new(schedule_params)

    respond_to do |format|
      if @schedule.save

SELECT  "schedules".* FROM "schedules"  WHERE "schedules"."id" = $1 LIMIT 1  [["id", 17]]
---
    def set_schedule
      @schedule = Schedule.find(params[:id])