RoR Server/app/controllers/sessions_controller.rb

  def signin
    puts "#{params[:email]}>>>>>>>>>>>>>>>>>"
    puts "#{params[:password]}>>>>>>>>>>>>>>>>>"
    @user = User.find_by(email: params[:email].downcase)
    #if user && user.authenticate(params[:session][:password])
    if @user.password == params[:password]
      @user.generate_remember_token
      respond_to do |format|
        if @user.save!
---
SELECT  "users".* FROM "users"  WHERE "users"."email" = 'omar.gudino.19971@gmail.com' LIMIT 1
UPDATE "users" SET "remember_token" = $1, "updated_at" = $2 WHERE "users"."id" = 19  [["remember_token", "63084af3f46f267bce040ed76d4fce6e"], ["updated_at", "2014-08-20 18:33:42.724422"]]

  def destroy
    user = current_user

    user.remember_token = nil
    if user.save
---
UPDATE "users" SET "remember_token" = $1, "updated_at" = $2 WHERE "users"."id" = 14  [["remember_token", "707a4a6b4ea7928b1317d2e3135708594351c10b"], ["updated_at", "2014-08-15 17:05:26.222828"]]