RoR Server/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def users_list
    @users = User.all

SELECT "users".* FROM "users"
UPDATE "users" SET "encrypted_password" = $1, "updated_at" = $2 WHERE "users"."id" = 19  [["encrypted_password", "$2a$10$Fe7XQsIU3GLNTT3Viu13Wue83WkSD./JmJyLGtRpd3oBynjUqfkeS"], ["updated_at", "2014-08-20 18:37:52.784769"]]
---
  def forgot_password
    email = (params[:email])
    User.all.each do |user|
      if user.email == email
        random_password = Array.new(10).map { (65 + rand(58)).chr }.join
         user.password = random_password
         user.save!

UPDATE "users" SET "encrypted_password" = $1, "updated_at" = $2 WHERE "users"."id" = 19  [["encrypted_password", "$2a$10$k/kgmmV2lY/W9x3j6TZUPO.8LvIUSFcIVzF3Qc43uG0zsxd7lD.ZK"], ["updated_at", "2014-08-20 20:01:54.576082"]]
---
  def reset_password
    user = current_user
    new_password = params[:new_password]
    if user.password == params[:old_password]
      user.password = new_password
      user.save!

INSERT INTO "users" ("created_at", "email", "first_name", "password", "schedule_id", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", "2014-08-13 19:29:16.326287"], ["email", "Rest"], ["first_name", "Rest"], ["password", "rest"], ["schedule_id", 1], ["updated_at", "2014-08-13 19:29:16.326287"]]
---
  def register
    @user = User.new(user_params)
    @user.password = params[:password]
    @user.generate_remember_token
    @user.points = 0
    respond_to do |format|
      if @user.save

INSERT INTO "users" ("created_at", "email", "first_name", "is_admin", "last_name", "password_digest", "points", "remember_token", "schedule_id", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    puts "bla <<<<<<<<<<<<<<<<<<<<<<<"
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "first_name" = $1, "schedule_id" = $2, "updated_at" = $3 WHERE "users"."id" = 59  [["first_name", "Fernando"], ["schedule_id", 18], ["updated_at", "2014-09-18 10:26:39.352585"]]
---
  def update_user
    @user = current_user
    respond_to do |format|
      if @user.update(user_params)