app/controllers/check_ins_controller.rb

SELECT "check_ins".* FROM "check_ins"
---
  def index
    @check_ins = CheckIn.all

INSERT INTO "check_ins" ("checked_in_at", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["checked_in_at", "2014-08-08 19:38:00.000000"], ["created_at", "2014-08-08 19:38:42.063931"], ["updated_at", "2014-08-08 19:38:42.063931"]]
---
  def create
    @check_in = CheckIn.new(check_in_params)

    respond_to do |format|
      if @check_in.save

SELECT  "check_ins".* FROM "check_ins"  WHERE "check_ins"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_check_in
      @check_in = CheckIn.find(params[:id])