app/controllers/schedules_controller.rb

SELECT "schedules".* FROM "schedules"
---
  def index
    @schedules = Schedule.all

INSERT INTO "schedules" ("check_in", "check_out", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["check_in", "2014-08-08 08:30:00.000000"], ["check_out", "2014-08-08 12:30:00.000000"], ["created_at", "2014-08-08 19:44:47.226215"], ["updated_at", "2014-08-08 19:44:47.226215"]]
---
  def create
    @schedule = Schedule.new(schedule_params)

    respond_to do |format|
      if @schedule.save

SELECT  "schedules".* FROM "schedules"  WHERE "schedules"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_schedule
      @schedule = Schedule.find(params[:id])