app/controllers/users_controller.rb

  def create
    puts "bla <<<<<<<<<<<<<<<<<<<<<<<"
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "email", "first_name", "is_admin", "last_name", "password", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["created_at", "2014-08-08 19:06:52.944191"], ["email", ""], ["first_name", "testing"], ["is_admin", "f"], ["last_name", ""], ["password", ""], ["updated_at", "2014-08-08 19:06:52.944191"]]